# **Prueba de sklearn**

### Consigna: El desafío actual consiste en generar un modelo de regresión logística que permita calcular el grado de accuracy con el  cual se pueda determinar, en el grupo de "prueba", quiénes son los sobrevivientes en la tragedia del Titanic.

#### Cargo las librerias correspondientes

In [1]:
# importar las librias 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

### Informacion sobre los datos que contienen los data set del Titanic

| Variable | Definition                                   | Key                                      |
|----------|-----------------------------------------------|-------------------------------------------|
| survival | Survival                                      | 0 = No, 1 = Yes                           |
| pclass   | Ticket class                                  | 1 = 1st, 2 = 2nd, 3 = 3rd                 |
| sex      | Sex                                           |                                           |
| age      | Age in years                                  |                                           |
| sibsp    | # of siblings / spouses aboard the Titanic    |                                           |
| parch    | # of parents / children aboard the Titanic    |                                           |
| ticket   | Ticket number                                 |                                           |
| fare     | Passenger fare                                |                                           |
| cabin    | Cabin number                                  |                                           |
| embarked | Port of Embarkation                           | C = Cherbourg, Q = Queenstown, S = Southampton |

| Variable | Notas |
|---------|-------|
| **pclass** | • Indicador aproximado del estatus socioeconómico (SES):<br> ▪ 1st: Clase alta<br> ▪ 2nd: Clase media<br> ▪ 3rd: Clase baja |
| **age** | • La edad es fraccionaria si el pasajero tiene menos de 1 año.<br>• Si la edad es estimada, aparece en formato **xx.5**. |
| **sibsp** | • El dataset define las relaciones familiares así:<br> ▪ **Sibling (hermano/a):** hermano, hermana, hermanastro, hermanastra<br> ▪ **Spouse (cónyuge):** esposo, esposa<br>• (Las amantes y novios/as no fueron considerados). |
| **parch** | • El dataset define las relaciones familiares así:<br> ▪ **Parent (padre/madre):** madre, padre<br> ▪ **Child (hijo/a):** hija, hijo, hijastro, hijastra<br>• Algunos niños viajaban solo con una niñera, por lo que **parch = 0**. |

#### Armo los Data Frames de train y test

In [14]:
# Cargar los data frame de train y test
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

#### Informacion de los data frame

In [15]:
# muestro el shape de train y test
print("Train shape:", train.shape)
print("Test shape:", test.shape)

# muestro las primeras filas de train
train.head()

Train shape: (891, 12)
Test shape: (418, 11)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
# muestra de las primeras filas de test
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S